УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиОрганизаций/КонтурЛогистика_НастройкиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиОрганизаций</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>String</types>
      <types>EnumRef.КонтурЛогистика_НастройкиОрганизацийДиадок</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиОрганизаций/ManagerModule.bsl
Процедура УдалитьНастройкуОрганизации(Организация, Настройка) Экспорт

	НаборЗаписей = РегистрыСведений.КонтурЛогистика_НастройкиОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(Организация);
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	НаборЗаписей.Записать()	

КонецПроцедуры
